Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.TwoPointsSelectedBeforeEdit
Two points have to be selected before existing the edit mode.

Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.PanelDoesntMatchCircuitProperties
The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit?

Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForWidth
Lining Thickness ([Lining Thickness Value]) is too large for current Width ([Width Value]).

Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForHeight
Lining Thickness ([Lining Thickness Value]) is too large for current Height ([Height Value]).

Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForDiameter
Lining Thickness ([Lining Thickness Value]) is too large for current Diameter ([Diameter Value]).

Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.InitialEqualFrictionSizingFailed
Initial Equal Friction Sizing failed.

Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures
Failures about HVAC.